#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Treasure_Hunter_Fashion_AnimBp

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Treasure_Hunter_Fashion_AnimBp.F_MED_Treasure_Hunter_Fashion_AnimBp_C
// 0x1C50 (0x22D0 - 0x0680)
class UF_MED_Treasure_Hunter_Fashion_AnimBp_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0688(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0690(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0698(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06B8(0x0180)(ContainsInstancedReference)
	uint8                                         Pad_838[0x8];                                      // 0x0838(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0840(0x0980)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x11C0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x11E0(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x1200(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1308(0x0128)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x1430(0x0510)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x1940(0x0980)()
	float                                         crouching_alpha;                                   // 0x22C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_F_MED_Treasure_Hunter_Fashion_AnimBp(int32 EntryPoint);
	void OnBeginCrouching();
	void OnEndCrouching();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Treasure_Hunter_Fashion_AnimBp_C">();
	}
	static class UF_MED_Treasure_Hunter_Fashion_AnimBp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Treasure_Hunter_Fashion_AnimBp_C>();
	}
};
static_assert(alignof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C) == 0x000010, "Wrong alignment on UF_MED_Treasure_Hunter_Fashion_AnimBp_C");
static_assert(sizeof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C) == 0x0022D0, "Wrong size on UF_MED_Treasure_Hunter_Fashion_AnimBp_C");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, UberGraphFrame) == 0x000680, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimBlueprintExtension_PropertyAccess) == 0x000688, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimBlueprintExtension_Base) == 0x000690, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimGraphNode_Root) == 0x000698, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006B8, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimGraphNode_RigidBody_1) == 0x000840, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimGraphNode_ComponentToLocalSpace) == 0x0011C0, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimGraphNode_LocalToComponentSpace) == 0x0011E0, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimGraphNode_Constraint) == 0x001200, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimGraphNode_ModifyBone) == 0x001308, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimGraphNode_AnimDynamics) == 0x001430, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, AnimGraphNode_RigidBody) == 0x001940, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Treasure_Hunter_Fashion_AnimBp_C, crouching_alpha) == 0x0022C0, "Member 'UF_MED_Treasure_Hunter_Fashion_AnimBp_C::crouching_alpha' has a wrong offset!");

}

