#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Mystic_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct M_MED_Mystic_AnimBP.M_MED_Mystic_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00F7 (0x00F8 - 0x0001)
struct M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_447;                               // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_448;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_449;                                  // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_450;                                // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_451;                                // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_452;                                // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_453;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_454;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_455;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_456;                              // 0x0048(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0060(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00E0(0x0018)()
};
static_assert(alignof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000F8, "Wrong size on M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_447) == 0x000008, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_447' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_448) == 0x000018, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_448' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_449) == 0x000020, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_449' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_450) == 0x000028, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_450' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_451) == 0x000029, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_451' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_452) == 0x00002A, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_452' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_453) == 0x000030, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_453' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_454) == 0x000040, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_454' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_455) == 0x000044, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_455' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_456) == 0x000048, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_456' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000060, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000E0, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct M_MED_Mystic_AnimBP.M_MED_Mystic_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0004 (0x0005 - 0x0001)
struct M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000005, "Wrong size on M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000004, "Member 'M_MED_Mystic_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");

}

